[
  "The Amazon rainforest covers over 5.5 million square kilometers, making it the largest tropical rainforest in the world.",
  "In chess, the Sicilian Defense begins with the moves 1.e4 c5 and is known for its asymmetrical structure.",
  "Aluminum was once considered more valuable than gold due to the difficulty of extraction in the 19th century.",
  "Saturn’s moon Titan has lakes of liquid methane and ethane on its surface, unlike any other body in the solar system.",
  "The 1986 Chernobyl disaster released at least 400 times more radioactive material than the atomic bomb dropped on Hiroshima.",
  "While kangaroos can’t walk backwards, they are excellent swimmers and can cross rivers when necessary.",
  "A group of flamingos is called a 'flamboyance,' which reflects both their color and social behavior.",
  "The Eiffel Tower can grow over 15 centimeters taller in the summer due to thermal expansion of the iron.",
  "Honey never spoils and has been found in ancient Egyptian tombs still preserved after thousands of years.",
  "Shakespeare introduced over 1,700 new words into the English language, many of which are still in use today.",
  "Octopuses have three hearts, and their blood is blue due to the copper-based molecule hemocyanin.",
  "The word 'quiz' was allegedly invented as part of a bet in Dublin in the late 18th century.",
  "The current population of Tokyo is greater than that of Canada, despite the city covering a much smaller area.",
  "Penguins have a special gland near their eyes that filters salt from seawater, allowing them to drink it.",
  "The Great Wall of China is not a single continuous wall but a series of structures built by different dynasties.",
  "Light from the Sun takes approximately 8 minutes and 20 seconds to reach Earth.",
  "Bananas are technically berries, while strawberries are not, according to botanical definitions.",
  "The U.S. Interstate Highway System has built-in airstrips every five miles in case of emergency military landings—this is actually a myth.",
  "Neil Armstrong’s famous quote was meant to include the article 'a': 'That's one small step for a man,' but it was inaudible.",
  "Sloths can take up to a month to digest a single leaf due to their extremely slow metabolism."
]
